#### Terraform Format and Style 🖌
#### Terraform Initialization ⚙️
#### Terraform Plan 📖
<details><summary>Show Plan</summary>

```terraform
aws_cloudwatch_log_group.waf_logs: Refreshing state... [id=aws-waf-logs-alb-alc]
aws_vpc.terraform_vpc: Refreshing state... [id=vpc-0519935737b85ca6c]
data.aws_ssm_parameter.amazonlinux_2: Reading...
aws_sns_topic.sns_topic_ec2: Refreshing state... [id=arn:aws:sns:ap-northeast-1:675175159712:EC2-CPU-Alarm-Topic]
aws_wafv2_web_acl.terraform_alb_waf: Refreshing state... [id=be538b91-6dd7-4aee-9271-95aa715baebe]
data.aws_ssm_parameter.amazonlinux_2: Read complete after 1s [id=/aws/service/ami-amazon-linux-latest/al2023-ami-kernel-default-x86_64]
aws_sns_topic_subscription.sns_subscription_ec2: Refreshing state... [id=arn:aws:sns:ap-northeast-1:675175159712:EC2-CPU-Alarm-Topic:5c3696ba-84ab-45ea-be82-b19c293df08f]
aws_internet_gateway.terraform_gw: Refreshing state... [id=igw-0473afaf4782478f0]
aws_subnet.terraform_subnet["public-1c"]: Refreshing state... [id=subnet-06f90f8b74fad51c1]
aws_security_group.terraform_alb_sg: Refreshing state... [id=sg-0dd276f5bc50b6cf9]
aws_subnet.terraform_subnet["private-1c"]: Refreshing state... [id=subnet-00b68e2fa63212958]
aws_lb_target_group.terraform_alb_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:675175159712:targetgroup/aws-study-alb-tg/29dd7bc3e9d5ae78]
aws_subnet.terraform_subnet["public-1a"]: Refreshing state... [id=subnet-01b31d93fbb670003]
aws_subnet.terraform_subnet["private-1a"]: Refreshing state... [id=subnet-0f3f3032cad557c1e]
aws_route_table.terraform_practice_routetable_private: Refreshing state... [id=rtb-07a994edd7291b654]
aws_wafv2_web_acl_logging_configuration.waf_log_config: Refreshing state... [id=arn:aws:wafv2:ap-northeast-1:675175159712:regional/webacl/terraform-study-alb-waf/be538b91-6dd7-4aee-9271-95aa715baebe]
aws_route_table.terraform_practice_routetable_public: Refreshing state... [id=rtb-029bfc7c4b61bbb26]
aws_security_group.terraform_ec2_sg: Refreshing state... [id=sg-013cff574b9c16e3c]
aws_route_table_association.terraform_association["private-1c"]: Refreshing state... [id=rtbassoc-0abfa2b6e3ce594cc]
aws_route_table_association.terraform_association["public-1c"]: Refreshing state... [id=rtbassoc-04de496e7e168f842]
aws_route_table_association.terraform_association["public-1a"]: Refreshing state... [id=rtbassoc-0efd511dff6bf00ea]
aws_route_table_association.terraform_association["private-1a"]: Refreshing state... [id=rtbassoc-001fe7940379ddfc9]
aws_db_subnet_group.terraform_db_subnet_group: Refreshing state... [id=terraform-study-db-subnet-group]
aws_lb.terraform_alb: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:675175159712:loadbalancer/app/aws-study-alb/0644c3a017932521]
aws_security_group.terraform_rds_sg: Refreshing state... [id=sg-080190b1d0ea2747f]
aws_instance.terraform_ec2: Refreshing state... [id=i-0d09eb8ea6665edc4]
aws_db_instance.terraform_rds: Refreshing state... [id=db-QMMU4E4Y5MNMUMFBVHMPHKCC4M]
aws_wafv2_web_acl_association.alb_waf_attach: Refreshing state... [id=arn:aws:wafv2:ap-northeast-1:675175159712:regional/webacl/terraform-study-alb-waf/be538b91-6dd7-4aee-9271-95aa715baebe,arn:aws:elasticloadbalancing:ap-northeast-1:675175159712:loadbalancer/app/aws-study-alb/0644c3a017932521]
aws_lb_listener.terraform_alb_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:675175159712:listener/app/aws-study-alb/0644c3a017932521/22345161ffc7c9c3]
aws_lb_target_group_attachment.terraform_target_ec2: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:675175159712:targetgroup/aws-study-alb-tg/29dd7bc3e9d5ae78-20260208025657378200000005]
aws_cloudwatch_metric_alarm.ALERT_EC2_CPUUtilization: Refreshing state... [id=EC2-CPUUtilization-Alarm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.terraform_ec2_2 will be created
  + resource "aws_instance" "terraform_ec2_2" {
      + ami                                  = (sensitive value)
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = "ap-northeast-1a"
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = false
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + force_destroy                        = false
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "aws-study"
      + monitoring                           = false
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_group_id                   = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + region                               = "ap-northeast-1"
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-01b31d93fbb670003"
      + tags                                 = {
          + "Name" = "terraform-study-ec2-2"
        }
      + tags_all                             = {
          + "Name" = "terraform-study-ec2-2"
        }
      + tenancy                              = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-013cff574b9c16e3c",
        ]

      + capacity_reservation_specification (known after apply)

      + cpu_options (known after apply)

      + ebs_block_device (known after apply)

      + enclave_options (known after apply)

      + ephemeral_block_device (known after apply)

      + instance_market_options (known after apply)

      + maintenance_options (known after apply)

      + metadata_options (known after apply)

      + network_interface (known after apply)

      + primary_network_interface (known after apply)

      + private_dns_name_options (known after apply)

      + root_block_device (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @nino-sann, Action: `pull_request`*